InformationRegisters/Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Напоминания</Name>
			<Comment>Данный Регистр предназначен для реализации механизма напоминаний. Напоминание - сообщение которое может быть выведено на экран любому пользователю конфигурации единожды либо с заданной регулярностью.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой напоминание считается актуальным. После этой даты даже не завершенные напоминания выводится не будут.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата оповещения как она заложена в напоминании без учета отсрочки напоминания пользователем и предварительного вывода напоминания.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Comment>Дата очередного напоминания, для непериодических напоминаний равняется дате начала как она заложена в напоминании без учета отсрочки напоминания пользователем и предварительного вывода напоминания.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание напоминания - сообщение содержащее суть напоминания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Comment>Индикатор редактирования объекта. Предназначен для запрета открытия и вывода напоминания во время редактирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДоНачала</Name>
					<Comment>Предназначен для хранения срока в секундах за который нужно предупредить о наступлении события</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Comment>Заголовок окна, который будет выведен при отображении напоминания</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПериода</Name>
					<Comment>Строка хранящая тип периода напоминания (1 -8) символ –  тип периодичности дня, (9  - 14) cимвол тип периодичности недели,  (15  - 16) cимвол тип периодичности месяца,  (17  - 18) cимвол тип периодичности года </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПоИстеченииСрока</Name>
					<Comment>Признак удаления напоминания после истечения даты актуальности, или после завершения(для не периодических напоминаний)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Реквизит предназначен для хранения ссылки на получателя напоминания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Comment>Реквизит предназначен для хранения ссылки на автора напоминания - (текущего пользователя), который создал напоминание</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Реквизит предназначен для хранения флага завершенности напоминания</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеальнаяДатаОповещения</Name>
					<Comment>Реквизит предназначен для хранения реальной даты когда будет выведено напоминание</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Ссылка на объект конфигурации прилагаемый к напоминанию</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Модуль_ГВС_Сервер/Ext/Module.bsl
Процедура СформироватьНапоминание (Тема,Описание,Объект = Неопределено ,ТаблицаПользователей)

	Пользователи = ТаблицаПользователей;
	Тема         = Тема;
	Описание     = Описание; 
	
	Если Объект <> Неопределено Тогда
		Объект       = Объект;                         
		КтоСоздал    = Объект.Автор;
	Иначе
		Объект ="";
		КтоСоздал = Справочники.Пользователи.Робот;
	КонецЕсли;
	
	Для Каждого Пользователь Из Пользователи Цикл	
		Напоминание = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();		
		Напоминание.Объект                  = Объект; 
		Напоминание.ДатаНачала              = ТекущаяДата(); 
		Напоминание.РеальнаяДатаОповещения  = ТекущаяДата() + 5; 
		Напоминание.ДатаОповещения          = ТекущаяДата(); 
		Напоминание.СрокДоНачала            = 0; 
		Напоминание.Автор                   = КтоСоздал; 
		Напоминание.Тема                    = Тема; 
		Напоминание.ТипПериода              = "00"; 
		Напоминание.ДатаАктуальности        = Дата(1,1,1,0,0,0); 
		Напоминание.Описание                = Описание; 
		Напоминание.УдалитьПоИстеченииСрока = Истина; 
		Напоминание.Редактирование          = Ложь;		
		Напоминание.Завершено               = Ложь;
		Напоминание.Пользователь            = Пользователь.Получатель;
		Напоминание.Записать();
		//РегистрыСведений.Напоминания.СоздатьНаборЗаписей().ПоказатьБаннер(Напоминание);
	КонецЦикла;
	
КонецПроцедуры

Процедура НапоминаниеОДнеРождения () Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|   Пользователи.Сотрудник.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Сотрудник.ФлагУволен
		|	И НЕ Пользователи.ЭтоГруппа
		|	И Пользователи.Сотрудник.Должность В
		|			(ВЫБРАТЬ
		|				ЗНАЧЕНИЕ(Справочник.Должности.Бухгалтер) КАК Д_1
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				&Должность)
		|	И ВЫБОР
		|			КОГДА ДЕНЬГОДА(Пользователи.Сотрудник.ДатаРождения) - (ДЕНЬГОДА(&ТекущаяДата)-1) = 1
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.НайтиПоКоду("ЦБ000254"));   //Бухга-касс. Предопред не работает
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	Тема = "Оповещение о Дне Рождения!!!";          
	ПеречислениеСотрудников = "";
	Для Каждого Строчка Из РезультатЗапроса Цикл
		ПеречислениеСотрудников = Строка(Строчка.Пользователь) + ПеречислениеСотрудников + Символы.ПС;
	КонецЦикла; 
	
	Описание = "У сотрудников " + ПеречислениеСотрудников + "завтра ДЕНЬ РОЖДЕНИЯ!!! :3 :D";
	
	КомуОтправить = Новый ТаблицаЗначений;
	КомуОтправить.Колонки.Добавить("Получатель",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	КомуОтправить.Добавить().Получатель = Справочники.Пользователи.НайтиПоКоду("Колесникова Елена Александровна");
	
	СформироватьНапоминание(Тема,Описание,,КомуОтправить);
		
КонецПроцедуры
